#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_vpc.legacy-vpc: Reading...
data.aws_iam_policy_document.assume_eks_role: Reading...
data.aws_iam_policy_document.assume_eks-worker_role: Reading...
data.aws_iam_policy_document.assume_eks-worker_role: Read complete after 0s [id=2851119427]
data.aws_iam_policy_document.assume_eks_role: Read complete after 0s [id=3552664922]
aws_iam_role.legacy_eks-worker_role: Refreshing state... [id=dev-legacy-eks-worker-role]
aws_iam_role.legacy_eks_role: Refreshing state... [id=dev-legacy-eks-role]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=dev-legacy-eks-worker-role-20231002015334364700000005]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=dev-legacy-eks-worker-role-20231002015334318600000002]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=dev-legacy-eks-worker-role-20231002015334371800000006]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=dev-legacy-eks-role-20231002015334352300000004]
data.aws_vpc.legacy-vpc: Read complete after 0s [id=vpc-07f21b0f96ab6ddf8]
data.aws_subnets.eks_subnets: Reading...
data.aws_subnets.eks_subnets: Read complete after 1s [id=us-east-1]
aws_eks_cluster.eks: Refreshing state... [id=dev-master-cluster]
data.aws_security_group.eks-cluster-sg: Reading...
aws_eks_node_group.node-group-1: Refreshing state... [id=dev-master-cluster:dev-master-node-group-1]
data.aws_security_group.eks-cluster-sg: Read complete after 0s [id=sg-0a757cdbcb1506791]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_addon.example will be created
  + resource "aws_eks_addon" "example" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "dev-master-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "PRESERVE"
      + tags_all                    = {
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
    }

  # aws_eks_node_group.node-group-0 will be created
  + resource "aws_eks_node_group" "node-group-0" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "dev-master-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
          + "t3a.small",
        ]
      + node_group_name        = "dev-master-node-group-0"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::169740125934:role/dev-legacy-eks-worker-role"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0d9939cf6df3de84b",
        ]
      + tags_all               = {
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_iam_role_policy_attachment.AmazonEC2RoleforSSM will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEC2RoleforSSM" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2RoleforSSM"
      + role       = "dev-legacy-eks-worker-role"
    }

  # aws_route53_zone.private-zone will be created
  + resource "aws_route53_zone" "private-zone" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "dev.master.legacy.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = {
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + zone_id             = (known after apply)

      + vpc {
          + vpc_id     = "vpc-07f21b0f96ab6ddf8"
          + vpc_region = (known after apply)
        }
    }

  # aws_vpc_endpoint.vpce["ec2"] will be created
  + resource "aws_vpc_endpoint" "vpce" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0a757cdbcb1506791",
        ]
      + service_name          = "com.amazonaws.us-east-1.ec2"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-00b658574c2a8b1f3",
          + "subnet-0d9939cf6df3de84b",
        ]
      + tags                  = {
          + "Name" = "vpce-ec2"
        }
      + tags_all              = {
          + "Name"        = "vpce-ec2"
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-07f21b0f96ab6ddf8"
    }

  # aws_vpc_endpoint.vpce["ec2messages"] will be created
  + resource "aws_vpc_endpoint" "vpce" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0a757cdbcb1506791",
        ]
      + service_name          = "com.amazonaws.us-east-1.ec2messages"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-00b658574c2a8b1f3",
          + "subnet-0d9939cf6df3de84b",
        ]
      + tags                  = {
          + "Name" = "vpce-ec2messages"
        }
      + tags_all              = {
          + "Name"        = "vpce-ec2messages"
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-07f21b0f96ab6ddf8"
    }

  # aws_vpc_endpoint.vpce["eks"] will be created
  + resource "aws_vpc_endpoint" "vpce" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0a757cdbcb1506791",
        ]
      + service_name          = "com.amazonaws.us-east-1.eks"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-00b658574c2a8b1f3",
          + "subnet-0d9939cf6df3de84b",
        ]
      + tags                  = {
          + "Name" = "vpce-eks"
        }
      + tags_all              = {
          + "Name"        = "vpce-eks"
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-07f21b0f96ab6ddf8"
    }

  # aws_vpc_endpoint.vpce["ssm"] will be created
  + resource "aws_vpc_endpoint" "vpce" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0a757cdbcb1506791",
        ]
      + service_name          = "com.amazonaws.us-east-1.ssm"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-00b658574c2a8b1f3",
          + "subnet-0d9939cf6df3de84b",
        ]
      + tags                  = {
          + "Name" = "vpce-ssm"
        }
      + tags_all              = {
          + "Name"        = "vpce-ssm"
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-07f21b0f96ab6ddf8"
    }

  # aws_vpc_endpoint.vpce["ssmmessages"] will be created
  + resource "aws_vpc_endpoint" "vpce" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0a757cdbcb1506791",
        ]
      + service_name          = "com.amazonaws.us-east-1.ssmmessages"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-00b658574c2a8b1f3",
          + "subnet-0d9939cf6df3de84b",
        ]
      + tags                  = {
          + "Name" = "vpce-ssmmessages"
        }
      + tags_all              = {
          + "Name"        = "vpce-ssmmessages"
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-07f21b0f96ab6ddf8"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + endpoint                              = "https://6619A0E8253BC7B4E17FF9E20FCC7740.gr7.us-east-1.eks.amazonaws.com"
  + kubeconfig-certificate-authority-data = (sensitive value)
  + oidc-issuer                           = [
      + {
          + oidc = [
              + {
                  + issuer = "https://oidc.eks.us-east-1.amazonaws.com/id/6619A0E8253BC7B4E17FF9E20FCC7740"
                },
            ]
        },
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"

```

</details>

*Pusher: @carlosgit2016, Action: `pull_request`, Working Directory: ``, Workflow: `scaffold-development`*